{
  "results": [
    {
      "keywords": [
        "van", 
        "rossum", 
        "overlord", 
        "python", 
        "pep", 
        "language", 
        "list", 
        "572", 
        "rossums", 
        "im", 
        "sysexits", 
        "proposal", 
        "guido", 
        "creator"
      ], 
      "published date": "Fri, 13 Jul 2018 00:00:00 GMT", 
      "summary": "Guido van Rossum – who created the Python programming language in 1989, was jokingly styled as its “benevolent dictator for life”, and ushered it to global ubiquity – has stepped down, and won’t appoint a successor.\nIn his friendly dictatorial role, Van Rossum signed off on each of proposal personally, an approach that contrasts strongly with comparable projects, such as PHP, that put such matters to a vote.\nAs is evident in threads such as this, some developers felt PEP 572 was a poor approach that reflected van Rossum’s opinions more than best practice.\nOn July 6, van Rossum posted: “I have been overwhelmed by the amount of feedback I've received on PEP 572.”And that was three days after the PEP was accepted.\nThe likes of YouTube, Instagram, and Dropbox (van Rossum’s day job) all use it.", 
      "url": "https://www.theregister.co.uk/2018/07/13/python_creator_guido_van_rossum_quits/"
    }, 
    {
      "keywords": [
        "van", 
        "rossum", 
        "decisions", 
        "issue", 
        "decided", 
        "need", 
        "leading", 
        "python", 
        "stepping", 
        "guido", 
        "im", 
        "think", 
        "hard", 
        "project", 
        "going", 
        "boss", 
        "doesnt"
      ], 
      "published date": "Fri, 13 Jul 2018 10:14:00 GMT", 
      "summary": "THE CREATOR of Python, one of the most used programming languages on this here shiny blue bauble, has decided its time to pass on the baton.\nGuido van Rossum, known as 'Benevolent Dictator For Life' until now, has decided that after 30 years, he doesn't want to think as hard about his creation and is switching to being an \"ordinary core developer\".\nRossum has confirmed he won't be involved in appointing his replacement.\nIn fact, it sounds very much like he doesn't think there should be one.\n\"I'm not worried about the day to day decisions in the issue tracker or on GitHub.", 
      "url": "https://www.theinquirer.net/inquirer/news/3035842/python-boss-guido-van-rossum-steps-down-after-30-years"
    }, 
    {
      "keywords": [
        "van", 
        "rossum", 
        "web", 
        "pythonistas", 
        "website", 
        "computer", 
        "languages", 
        "python", 
        "audience", 
        "language", 
        "packages", 
        "users", 
        "brought", 
        "programming", 
        "vast"
      ], 
      "published date": "Sat, 21 Jul 2018 00:00:00 GMT", 
      "summary": "IN DECEMBER 1989 Guido van Rossum, a Dutch computer scientist, set himself a Christmas project.\nNearly 30 years after his Christmas invention, Mr Van Rossum resembles a technological version of the Monty Python character who accidentally became the Messiah in the film “Life of Brian”.\nMr Van Rossum, though delighted by this enthusiasm for his software, has come to find the rigours of supervising it, in his role as “benevolent dictator for life”, unbearable.\nMr Van Rossum says that Python has become the language of choice for AI researchers, who have produced numerous packages for it.\nIt is nevertheless true that, in that long-past Yuletide, Mr Van Rossum started something memorable.", 
      "url": "https://www.economist.com/science-and-technology/2018/07/21/python-has-brought-computer-programming-to-a-vast-new-audience"
    }, 
    {
      "keywords": [
        "van", 
        "rossum", 
        "chief", 
        "quite", 
        "quit", 
        "python", 
        "pep", 
        "572", 
        "core", 
        "developers", 
        "proposal", 
        "guido", 
        "bdfl"
      ], 
      "published date": "Fri, 20 Jul 2018 13:45:47 GMT", 
      "summary": "7 min readIt was the proverbial ‘end of an era’ for Python as Guido van Rossum stepped down as the Python chief, almost 3 decades since he created the programming language.\nThey are not to be considered as inputs directly received from the Python community or Guido van Rossum himself.\nWhat PEP 572 is all aboutThe idea behind PEP 572 is quite simple – to allow assignment to variables within expressions.\nEventually the PEP 572 was accepted by Guido van Rossum, as he settled the matter with the following note:Thank you all.\n— Guido van Rossum (@gvanrossum) July 12, 2018Call him a dictator if you will, his contributions to Python cannot be taken away.", 
      "url": "https://hub.packtpub.com/why-guido-van-rossum-quit/"
    }, 
    {
      "keywords": [
        "benchmarks", 
        "implementation", 
        "approved", 
        "python", 
        "pep", 
        "chosen", 
        "cython", 
        "core", 
        "guido", 
        "peps", 
        "community", 
        "bdfl"
      ], 
      "published date": "Tue, 24 Jul 2018 16:00:15 GMT", 
      "summary": "The news comes after Python founder and “Benevolent Dictator for Life (BDFL)” Guido van Rossum, announced earlier this month that he was standing down from the decision-making process.\nHere’s a quick look at Why Guido may have quit as the Python chief (BDFL).\nA PEP – or Python Enhancement Proposal – is a design document consisting of information important to the Python community.\nHe implemented Cython compilation of SageMath on Python 2.7.15 (SageMath is not yet ported to Python 3).\nThe new BDFL may be less demanding though.”Stefan Behnel, a core Cython developer, was disappointed with Rossum’s response..", 
      "url": "https://hub.packtpub.com/no-new-peps-will-be-approved-for-python-until-a-new-bdfl-is-chosen-next-year/"
    }
  ]
}
